<?xml version="1.0" ?>
<net name="single-image-super-resolution-1033" version="10">
	<layers>
		<layer id="0" name="6286323440" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="1" name="6296333128" type="Const" version="opset1">
			<data element_type="f16" offset="2" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="2" name="6306343032" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="3" name="6316353068" type="Const" version="opset1">
			<data element_type="f16" offset="2" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="4" name="5485523164" type="Const" version="opset1">
			<data element_type="f16" offset="4" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="5" name="5495533380" type="Const" version="opset1">
			<data element_type="f16" offset="6" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="6" name="5505543206" type="Const" version="opset1">
			<data element_type="f16" offset="4" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="7" name="5515553131" type="Const" version="opset1">
			<data element_type="f16" offset="6" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="8" name="7287323347" type="Const" version="opset1">
			<data element_type="f16" offset="8" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="9" name="7297332948" type="Const" version="opset1">
			<data element_type="f16" offset="10" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="10" name="7307343422" type="Const" version="opset1">
			<data element_type="f16" offset="8" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="11" name="7317353182" type="Const" version="opset1">
			<data element_type="f16" offset="10" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="12" name="4684723146" type="Const" version="opset1">
			<data element_type="f16" offset="8" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="13" name="4694733302" type="Const" version="opset1">
			<data element_type="f16" offset="12" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="14" name="4704743275" type="Const" version="opset1">
			<data element_type="f16" offset="8" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="15" name="4714753341" type="Const" version="opset1">
			<data element_type="f16" offset="12" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="16" name="110711113272" type="Const" version="opset1">
			<data element_type="f16" offset="14" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="17" name="110811123062" type="Const" version="opset1">
			<data element_type="f16" offset="16" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="18" name="110911133095" type="Const" version="opset1">
			<data element_type="f16" offset="14" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="19" name="111011142945" type="Const" version="opset1">
			<data element_type="f16" offset="16" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="20" name="8288323029" type="Const" version="opset1">
			<data element_type="f16" offset="18" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="21" name="8298332957" type="Const" version="opset1">
			<data element_type="f16" offset="20" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="22" name="8308343089" type="Const" version="opset1">
			<data element_type="f16" offset="18" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="23" name="8318353143" type="Const" version="opset1">
			<data element_type="f16" offset="20" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="24" name="3253272912" type="Const" version="opset1">
			<data element_type="f16" offset="22" shape="1,16,1,1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="5285323140" type="Const" version="opset1">
			<data element_type="f16" offset="8" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="26" name="5295333011" type="Const" version="opset1">
			<data element_type="f16" offset="54" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="27" name="5305343218" type="Const" version="opset1">
			<data element_type="f16" offset="8" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="28" name="5315352990" type="Const" version="opset1">
			<data element_type="f16" offset="54" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="29" name="3213232993" type="Const" version="opset1">
			<data element_type="f16" offset="22" shape="1,16,1,1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="5885923233" type="Const" version="opset1">
			<data element_type="f16" offset="8" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="31" name="5895933344" type="Const" version="opset1">
			<data element_type="f16" offset="56" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="32" name="5905943005" type="Const" version="opset1">
			<data element_type="f16" offset="8" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="33" name="5915952915" type="Const" version="opset1">
			<data element_type="f16" offset="56" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="34" name="7087123389" type="Const" version="opset1">
			<data element_type="f16" offset="58" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="35" name="7097133410" type="Const" version="opset1">
			<data element_type="f16" offset="60" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="36" name="7107143125" type="Const" version="opset1">
			<data element_type="f16" offset="58" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="37" name="7117153383" type="Const" version="opset1">
			<data element_type="f16" offset="60" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="38" name="3173192936" type="Const" version="opset1">
			<data element_type="f16" offset="22" shape="1,16,1,1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="5685723254" type="Const" version="opset1">
			<data element_type="f16" offset="8" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="40" name="5695732969" type="Const" version="opset1">
			<data element_type="f16" offset="62" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="41" name="5705743416" type="Const" version="opset1">
			<data element_type="f16" offset="8" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="42" name="5715752951" type="Const" version="opset1">
			<data element_type="f16" offset="62" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="43" name="3133153281" type="Const" version="opset1">
			<data element_type="f16" offset="22" shape="1,16,1,1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="6086122906" type="Const" version="opset1">
			<data element_type="f16" offset="8" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="45" name="6096133116" type="Const" version="opset1">
			<data element_type="f16" offset="64" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="46" name="6106143041" type="Const" version="opset1">
			<data element_type="f16" offset="8" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="47" name="6116153224" type="Const" version="opset1">
			<data element_type="f16" offset="64" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="48" name="7887923419" type="Const" version="opset1">
			<data element_type="f16" offset="66" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="49" name="7897933065" type="Const" version="opset1">
			<data element_type="f16" offset="68" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="50" name="7907943299" type="Const" version="opset1">
			<data element_type="f16" offset="66" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="51" name="7917953053" type="Const" version="opset1">
			<data element_type="f16" offset="68" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="52" name="3093113362" type="Const" version="opset1">
			<data element_type="f16" offset="22" shape="1,16,1,1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="7687723056" type="Const" version="opset1">
			<data element_type="f16" offset="8" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="54" name="7697732975" type="Const" version="opset1">
			<data element_type="f16" offset="70" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="55" name="7707743017" type="Const" version="opset1">
			<data element_type="f16" offset="8" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="56" name="7717753158" type="Const" version="opset1">
			<data element_type="f16" offset="70" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="57" name="3053073443" type="Const" version="opset1">
			<data element_type="f16" offset="22" shape="1,16,1,1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="5085123092" type="Const" version="opset1">
			<data element_type="f16" offset="8" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="59" name="5095133257" type="Const" version="opset1">
			<data element_type="f16" offset="72" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="60" name="5105143050" type="Const" version="opset1">
			<data element_type="f16" offset="8" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="61" name="5115153329" type="Const" version="opset1">
			<data element_type="f16" offset="72" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="62" name="8088123260" type="Const" version="opset1">
			<data element_type="f16" offset="74" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="63" name="8098133110" type="Const" version="opset1">
			<data element_type="f16" offset="76" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="64" name="8108142942" type="Const" version="opset1">
			<data element_type="f16" offset="74" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="65" name="8118153374" type="Const" version="opset1">
			<data element_type="f16" offset="76" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="66" name="3013033086" type="Const" version="opset1">
			<data element_type="f16" offset="22" shape="1,16,1,1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="6886923308" type="Const" version="opset1">
			<data element_type="f16" offset="8" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="68" name="6896933242" type="Const" version="opset1">
			<data element_type="f16" offset="78" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="69" name="6906943320" type="Const" version="opset1">
			<data element_type="f16" offset="8" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="70" name="6916953077" type="Const" version="opset1">
			<data element_type="f16" offset="78" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="71" name="2972993236" type="Const" version="opset1">
			<data element_type="f16" offset="22" shape="1,16,1,1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="6486523203" type="Const" version="opset1">
			<data element_type="f16" offset="8" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="73" name="6496533311" type="Const" version="opset1">
			<data element_type="f16" offset="80" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="74" name="6506543026" type="Const" version="opset1">
			<data element_type="f16" offset="8" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="75" name="6516552903" type="Const" version="opset1">
			<data element_type="f16" offset="80" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="76" name="6686723365" type="Const" version="opset1">
			<data element_type="f16" offset="8" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="77" name="6696732924" type="Const" version="opset1">
			<data element_type="f16" offset="82" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="78" name="6706743263" type="Const" version="opset1">
			<data element_type="f16" offset="8" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="79" name="6716753020" type="Const" version="opset1">
			<data element_type="f16" offset="82" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="80" name="0" type="Parameter" version="opset1">
			<data element_type="f16" shape="1,3,360,640"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="26/WithoutBiases/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="0/scale_copy1261566/quantized19563137" type="Const" version="opset1">
			<data element_type="i8" offset="84" shape="16,3,3,3" size="432"/>
			<output>
				<port id="0" precision="I8">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="0/scale_copy1261566/quantized/to_f16" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="26/WithoutBiases/fq_weights_1/zero_point19693449" type="Const" version="opset1">
			<data element_type="f16" offset="516" shape="16,1,1,1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="26/WithoutBiases/fq_weights_1/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="26/WithoutBiases/fq_weights_1/scale19643305" type="Const" version="opset1">
			<data element_type="f16" offset="548" shape="16,1,1,1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="26/WithoutBiases/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="26/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1,1" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="26/Dims10171283197" type="Const" version="opset1">
			<data element_type="f16" offset="580" shape="1,16,1,1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="26" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="26" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="27" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="1" names="27" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="28" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="1" names="28" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="29/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="81321568/quantized18363437" type="Const" version="opset1">
			<data element_type="i8" offset="612" shape="16,16,3,3" size="2304"/>
			<output>
				<port id="0" precision="I8">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="81321568/quantized/to_f16" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="29/fq_weights_1/zero_point18493002" type="Const" version="opset1">
			<data element_type="f16" offset="2916" shape="16,1,1,1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="29/fq_weights_1/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="29/fq_weights_1/scale18443428" type="Const" version="opset1">
			<data element_type="f16" offset="2948" shape="16,1,1,1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="29/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="29" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1,1" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="29" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="29/add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="30" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="1" names="30" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="31/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="91351569/quantized17883284" type="Const" version="opset1">
			<data element_type="i8" offset="2980" shape="16,16,3,3" size="2304"/>
			<output>
				<port id="0" precision="I8">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="91351569/quantized/to_f16" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="31/fq_weights_1/zero_point18013227" type="Const" version="opset1">
			<data element_type="f16" offset="5284" shape="16,1,1,1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="31/fq_weights_1/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="31/fq_weights_1/scale17963248" type="Const" version="opset1">
			<data element_type="f16" offset="5316" shape="16,1,1,1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="31/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="31" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1,1" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="31" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="31/add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="32/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="8188223149" type="Const" version="opset1">
			<data element_type="f16" offset="8" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="114" name="8198233188" type="Const" version="opset1">
			<data element_type="f16" offset="80" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="115" name="8208242996" type="Const" version="opset1">
			<data element_type="f16" offset="8" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="116" name="8218252918" type="Const" version="opset1">
			<data element_type="f16" offset="80" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="117" name="32/fq_input_1" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="32" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="2" names="32" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="33" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="1" names="33" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="34/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="101391570/quantized20283317" type="Const" version="opset1">
			<data element_type="i8" offset="5348" shape="16,16,3,3" size="2304"/>
			<output>
				<port id="0" precision="I8">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="101391570/quantized/to_f16" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="34/fq_weights_1/zero_point20413185" type="Const" version="opset1">
			<data element_type="f16" offset="7652" shape="16,1,1,1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="34/fq_weights_1/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="34/fq_weights_1/scale20363170" type="Const" version="opset1">
			<data element_type="f16" offset="7684" shape="16,1,1,1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="34/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="34" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1,1" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="34" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="34/add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="35" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="1" names="35" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="36/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="111421571/quantized19323035" type="Const" version="opset1">
			<data element_type="i8" offset="7716" shape="16,16,3,3" size="2304"/>
			<output>
				<port id="0" precision="I8">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="111421571/quantized/to_f16" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="36/fq_weights_1/zero_point19452897" type="Const" version="opset1">
			<data element_type="f16" offset="10020" shape="16,1,1,1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="36/fq_weights_1/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="135" name="36/fq_weights_1/scale19403356" type="Const" version="opset1">
			<data element_type="f16" offset="10052" shape="16,1,1,1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="136" name="36/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="137" name="36" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1,1" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="36" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="138" name="36/add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="139" name="37/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="140" name="7988023350" type="Const" version="opset1">
			<data element_type="f16" offset="10084" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="141" name="7998032933" type="Const" version="opset1">
			<data element_type="f16" offset="10086" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="142" name="8008043113" type="Const" version="opset1">
			<data element_type="f16" offset="10084" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="143" name="8018052894" type="Const" version="opset1">
			<data element_type="f16" offset="10086" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="144" name="37/fq_input_1" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="145" name="37" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="2" names="37" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="146" name="38" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="1" names="38" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="147" name="39/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="148" name="121461572/quantized19082966" type="Const" version="opset1">
			<data element_type="i8" offset="10088" shape="16,16,3,3" size="2304"/>
			<output>
				<port id="0" precision="I8">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="149" name="121461572/quantized/to_f16" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="150" name="39/fq_weights_1/zero_point19213179" type="Const" version="opset1">
			<data element_type="f16" offset="12392" shape="16,1,1,1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="151" name="39/fq_weights_1/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="152" name="39/fq_weights_1/scale19162999" type="Const" version="opset1">
			<data element_type="f16" offset="12424" shape="16,1,1,1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="153" name="39/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="154" name="39" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1,1" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="39" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="155" name="39/add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="156" name="40" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="1" names="40" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="157" name="41/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="158" name="131491573/quantized20043038" type="Const" version="opset1">
			<data element_type="i8" offset="12456" shape="16,16,3,3" size="2304"/>
			<output>
				<port id="0" precision="I8">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="159" name="131491573/quantized/to_f16" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="160" name="41/fq_weights_1/zero_point20173425" type="Const" version="opset1">
			<data element_type="f16" offset="14760" shape="16,1,1,1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="161" name="41/fq_weights_1/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="162" name="41/fq_weights_1/scale20122960" type="Const" version="opset1">
			<data element_type="f16" offset="14792" shape="16,1,1,1" size="32"/>
			<output>
