<?xml version="1.0" ?>
<net name="LPRNet" version="10">
	<layers>
		<layer id="0" name="seq_ind" type="Parameter" version="opset1">
			<data element_type="f16" shape="88,1"/>
			<output>
				<port id="0" names="seq_ind" precision="FP16">
					<dim>88</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="tile/tiles103630632002899" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="811982839" type="Const" version="opset1">
			<data element_type="i64" offset="32" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="3363402776" type="Const" version="opset1">
			<data element_type="f16" offset="64" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="4" name="3373412824" type="Const" version="opset1">
			<data element_type="f16" offset="66" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="5" name="3383422983" type="Const" version="opset1">
			<data element_type="f16" offset="64" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="6" name="3393432734" type="Const" version="opset1">
			<data element_type="f16" offset="66" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="7" name="8538572815" type="Const" version="opset1">
			<data element_type="f16" offset="64" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="8" name="8548582893" type="Const" version="opset1">
			<data element_type="f16" offset="68" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="9" name="8558592947" type="Const" version="opset1">
			<data element_type="f16" offset="64" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="10" name="8568602986" type="Const" version="opset1">
			<data element_type="f16" offset="68" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="11" name="6566602731" type="Const" version="opset1">
			<data element_type="f16" offset="64" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="12" name="6576612704" type="Const" version="opset1">
			<data element_type="f16" offset="70" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="13" name="6586622755" type="Const" version="opset1">
			<data element_type="f16" offset="64" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="14" name="6596632968" type="Const" version="opset1">
			<data element_type="f16" offset="70" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="15" name="3763802698" type="Const" version="opset1">
			<data element_type="f16" offset="64" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="16" name="3773812995" type="Const" version="opset1">
			<data element_type="f16" offset="72" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="17" name="3783822761" type="Const" version="opset1">
			<data element_type="f16" offset="64" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="18" name="3793832737" type="Const" version="opset1">
			<data element_type="f16" offset="72" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="19" name="5365402854" type="Const" version="opset1">
			<data element_type="f16" offset="64" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="20" name="5375412629" type="Const" version="opset1">
			<data element_type="f16" offset="74" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="21" name="5385422626" type="Const" version="opset1">
			<data element_type="f16" offset="64" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="22" name="5395432647" type="Const" version="opset1">
			<data element_type="f16" offset="74" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="23" name="4364402728" type="Const" version="opset1">
			<data element_type="f16" offset="64" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="24" name="4374412935" type="Const" version="opset1">
			<data element_type="f16" offset="76" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="25" name="4384422752" type="Const" version="opset1">
			<data element_type="f16" offset="64" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="26" name="4394432992" type="Const" version="opset1">
			<data element_type="f16" offset="76" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="27" name="4164202821" type="Const" version="opset1">
			<data element_type="f16" offset="64" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="28" name="4174212743" type="Const" version="opset1">
			<data element_type="f16" offset="78" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="29" name="4184222707" type="Const" version="opset1">
			<data element_type="f16" offset="64" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="30" name="4194232638" type="Const" version="opset1">
			<data element_type="f16" offset="78" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="31" name="3563602683" type="Const" version="opset1">
			<data element_type="f16" offset="64" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="32" name="3573612818" type="Const" version="opset1">
			<data element_type="f16" offset="80" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="33" name="3583622656" type="Const" version="opset1">
			<data element_type="f16" offset="64" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="34" name="3593632806" type="Const" version="opset1">
			<data element_type="f16" offset="80" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="35" name="5765802740" type="Const" version="opset1">
			<data element_type="f16" offset="64" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="36" name="5775812641" type="Const" version="opset1">
			<data element_type="f16" offset="82" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="37" name="5785822812" type="Const" version="opset1">
			<data element_type="f16" offset="64" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="38" name="5795832971" type="Const" version="opset1">
			<data element_type="f16" offset="82" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="39" name="8738772875" type="Const" version="opset1">
			<data element_type="f16" offset="64" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="40" name="8748782974" type="Const" version="opset1">
			<data element_type="f16" offset="84" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="41" name="8758792632" type="Const" version="opset1">
			<data element_type="f16" offset="64" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="42" name="8768802920" type="Const" version="opset1">
			<data element_type="f16" offset="84" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="43" name="6166202770" type="Const" version="opset1">
			<data element_type="f16" offset="64" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="44" name="6176212659" type="Const" version="opset1">
			<data element_type="f16" offset="86" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="45" name="6186222878" type="Const" version="opset1">
			<data element_type="f16" offset="64" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="46" name="6196232671" type="Const" version="opset1">
			<data element_type="f16" offset="86" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="47" name="4564602773" type="Const" version="opset1">
			<data element_type="f16" offset="64" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="48" name="4574612662" type="Const" version="opset1">
			<data element_type="f16" offset="88" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="49" name="4584622719" type="Const" version="opset1">
			<data element_type="f16" offset="64" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="50" name="4594632953" type="Const" version="opset1">
			<data element_type="f16" offset="88" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="51" name="5165202911" type="Const" version="opset1">
			<data element_type="f16" offset="64" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="52" name="5175212863" type="Const" version="opset1">
			<data element_type="f16" offset="90" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="53" name="5185222866" type="Const" version="opset1">
			<data element_type="f16" offset="64" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="54" name="5195232722" type="Const" version="opset1">
			<data element_type="f16" offset="90" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="55" name="6366402932" type="Const" version="opset1">
			<data element_type="f16" offset="64" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="56" name="6376412890" type="Const" version="opset1">
			<data element_type="f16" offset="92" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="57" name="6386422938" type="Const" version="opset1">
			<data element_type="f16" offset="64" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="58" name="6396432929" type="Const" version="opset1">
			<data element_type="f16" offset="92" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="59" name="data" type="Parameter" version="opset1">
			<data element_type="f16" shape="1,3,24,94"/>
			<output>
				<port id="0" names="data" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>24</dim>
					<dim>94</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="conv1/WithoutBiases/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>24</dim>
					<dim>94</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>24</dim>
					<dim>94</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="521091628/quantized18602764" type="Const" version="opset1">
			<data element_type="i8" offset="94" shape="64,3,3,3" size="1728"/>
			<output>
				<port id="0" precision="I8">
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="521091628/quantized/to_f16" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="conv1/WithoutBiases/fq_weights_1/zero_point18732914" type="Const" version="opset1">
			<data element_type="f16" offset="1822" shape="64,1,1,1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="conv1/WithoutBiases/fq_weights_1/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="conv1/WithoutBiases/fq_weights_1/scale18682989" type="Const" version="opset1">
			<data element_type="f16" offset="1950" shape="64,1,1,1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="conv1/WithoutBiases/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="conv1/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1,1" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>24</dim>
					<dim>94</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>94</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="conv1/Dims7501112887" type="Const" version="opset1">
			<data element_type="f16" offset="2078" shape="1,64,1,1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="conv1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>94</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>94</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="relu_conv1" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>94</dim>
				</port>
			</input>
			<output>
				<port id="1" names="conv1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>94</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="pool1" type="MaxPool" version="opset1">
			<data auto_pad="explicit" kernel="3,3" pads_begin="0,0" pads_end="0,0" rounding_type="ceil" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>94</dim>
				</port>
			</input>
			<output>
				<port id="1" names="pool1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="fire1_small/conv_reduce/WithoutBiases/fq_weights_1414" type="Const" version="opset1">
			<data element_type="f16" offset="2206" shape="32,64,1,1" size="4096"/>
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="fire1_small/conv_reduce/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="fire1_small/conv_reduce/Dims7621172692" type="Const" version="opset1">
			<data element_type="f16" offset="6302" shape="1,32,1,1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="fire1_small/conv_reduce" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="fire1_small/conv_reduce" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="fire1_small/relu_conv_reduce" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</input>
			<output>
				<port id="1" names="fire1_small/conv_reduce" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="fire1_small/conv_3x1/WithoutBiases/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="501201632/quantized20042884" type="Const" version="opset1">
			<data element_type="i8" offset="6366" shape="32,32,3,1" size="3072"/>
			<output>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="501201632/quantized/to_f16" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="fire1_small/conv_3x1/WithoutBiases/fq_weights_1/zero_point20172767" type="Const" version="opset1">
			<data element_type="f16" offset="9438" shape="32,1,1,1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="fire1_small/conv_3x1/WithoutBiases/fq_weights_1/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="fire1_small/conv_3x1/WithoutBiases/fq_weights_1/scale20122758" type="Const" version="opset1">
			<data element_type="f16" offset="9502" shape="32,1,1,1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="fire1_small/conv_3x1/WithoutBiases/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="fire1_small/conv_3x1/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1,1" pads_begin="1,0" pads_end="1,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="fire1_small/conv_3x1/Dims7861222689" type="Const" version="opset1">
			<data element_type="f16" offset="9566" shape="1,32,1,1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="fire1_small/conv_3x1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="fire1_small/conv_3x1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="fire1_small/relu_conv_3x1" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</input>
			<output>
				<port id="1" names="fire1_small/conv_3x1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="fire1_small/conv_1x3/WithoutBiases/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="721251634/quantized18842941" type="Const" version="opset1">
			<data element_type="i8" offset="9630" shape="32,32,1,3" size="3072"/>
			<output>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="721251634/quantized/to_f16" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="fire1_small/conv_1x3/WithoutBiases/fq_weights_1/zero_point18972644" type="Const" version="opset1">
			<data element_type="f16" offset="12702" shape="32,1,1,1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="fire1_small/conv_1x3/WithoutBiases/fq_weights_1/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="fire1_small/conv_1x3/WithoutBiases/fq_weights_1/scale18922794" type="Const" version="opset1">
			<data element_type="f16" offset="12766" shape="32,1,1,1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="fire1_small/conv_1x3/WithoutBiases/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="fire1_small/conv_1x3/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1,1" pads_begin="0,1" pads_end="0,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="fire1_small/conv_1x3/Dims7681272860" type="Const" version="opset1">
			<data element_type="f16" offset="12830" shape="1,32,1,1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="fire1_small/conv_1x3" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="fire1_small/conv_1x3" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="fire1_small/relu_conv_1x3" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</input>
			<output>
				<port id="1" names="fire1_small/conv_1x3" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="fire1_small/conv_expand/WithoutBiases/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="601301636/quantized17882635" type="Const" version="opset1">
			<data element_type="i8" offset="12894" shape="128,32,1,1" size="4096"/>
			<output>
				<port id="0" precision="I8">
					<dim>128</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="601301636/quantized/to_f16" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="fire1_small/conv_expand/WithoutBiases/fq_weights_1/zero_point18012623" type="Const" version="opset1">
			<data element_type="f16" offset="16990" shape="128,1,1,1" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="fire1_small/conv_expand/WithoutBiases/fq_weights_1/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>128</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="fire1_small/conv_expand/WithoutBiases/fq_weights_1/scale17962833" type="Const" version="opset1">
			<data element_type="f16" offset="17246" shape="128,1,1,1" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="fire1_small/conv_expand/WithoutBiases/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>128</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="fire1_small/conv_expand/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="fire1_small/conv_expand/Dims7561322881" type="Const" version="opset1">
			<data element_type="f16" offset="17502" shape="1,128,1,1" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="fire1_small/conv_expand" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="fire1_small/conv_expand" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="fire1_small/relu_conv_expand" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</input>
			<output>
				<port id="1" names="fire1_small/conv_expand" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="pool2/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="pool2" type="MaxPool" version="opset1">
			<data auto_pad="explicit" kernel="3,3" pads_begin="0,0" pads_end="0,0" rounding_type="ceil" strides="2,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</input>
			<output>
				<port id="1" names="pool2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="481361638/quantized19322857" type="Const" version="opset1">
			<data element_type="i8" offset="17758" shape="64,128,1,1" size="8192"/>
			<output>
				<port id="0" precision="I8">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="481361638/quantized/to_f16" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="fire2_small/conv_reduce/WithoutBiases/fq_weights_1/zero_point19452686" type="Const" version="opset1">
			<data element_type="f16" offset="25950" shape="64,1,1,1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="fire2_small/conv_reduce/WithoutBiases/fq_weights_1/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="fire2_small/conv_reduce/WithoutBiases/fq_weights_1/scale19402782" type="Const" version="opset1">
			<data element_type="f16" offset="26078" shape="64,1,1,1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="fire2_small/conv_reduce/WithoutBiases/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="fire2_small/conv_reduce/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="fire2_small/conv_reduce/Dims7141382677" type="Const" version="opset1">
			<data element_type="f16" offset="26206" shape="1,64,1,1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="fire2_small/conv_reduce" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="fire2_small/conv_reduce" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="fire2_small/relu_conv_reduce" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1" names="fire2_small/conv_reduce" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="fire2_small/conv_3x1/WithoutBiases/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="681411640/quantized20282701" type="Const" version="opset1">
			<data element_type="i8" offset="26334" shape="64,64,3,1" size="12288"/>
			<output>
				<port id="0" precision="I8">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="681411640/quantized/to_f16" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="fire2_small/conv_3x1/WithoutBiases/fq_weights_1/zero_point20412785" type="Const" version="opset1">
			<data element_type="f16" offset="38622" shape="64,1,1,1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="fire2_small/conv_3x1/WithoutBiases/fq_weights_1/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="fire2_small/conv_3x1/WithoutBiases/fq_weights_1/scale20362917" type="Const" version="opset1">
			<data element_type="f16" offset="38750" shape="64,1,1,1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="fire2_small/conv_3x1/WithoutBiases/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="fire2_small/conv_3x1/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1,1" pads_begin="1,0" pads_end="1,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="fire2_small/conv_3x1/Dims7321432800" type="Const" version="opset1">
			<data element_type="f16" offset="38878" shape="1,64,1,1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="fire2_small/conv_3x1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="fire2_small/conv_3x1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="fire2_small/relu_conv_3x1" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1" names="fire2_small/conv_3x1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="fire2_small/conv_1x3/WithoutBiases/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="701461642/quantized20762713" type="Const" version="opset1">
			<data element_type="i8" offset="39006" shape="64,64,1,3" size="12288"/>
			<output>
				<port id="0" precision="I8">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="135" name="701461642/quantized/to_f16" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="136" name="fire2_small/conv_1x3/WithoutBiases/fq_weights_1/zero_point20892872" type="Const" version="opset1">
			<data element_type="f16" offset="51294" shape="64,1,1,1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="137" name="fire2_small/conv_1x3/WithoutBiases/fq_weights_1/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="138" name="fire2_small/conv_1x3/WithoutBiases/fq_weights_1/scale20842746" type="Const" version="opset1">
			<data element_type="f16" offset="51422" shape="64,1,1,1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="139" name="fire2_small/conv_1x3/WithoutBiases/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="140" name="fire2_small/conv_1x3/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1,1" pads_begin="0,1" pads_end="0,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="141" name="fire2_small/conv_1x3/Dims7381482803" type="Const" version="opset1">
			<data element_type="f16" offset="51550" shape="1,64,1,1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="142" name="fire2_small/conv_1x3" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="fire2_small/conv_1x3" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="143" name="fire2_small/relu_conv_1x3" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1" names="fire2_small/conv_1x3" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="144" name="fire2_small/conv_expand/WithoutBiases/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="145" name="541511644/quantized21002962" type="Const" version="opset1">
			<data element_type="i8" offset="51678" shape="256,64,1,1" size="16384"/>
			<output>
				<port id="0" precision="I8">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="146" name="541511644/quantized/to_f16" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>256</dim>
